* Table and init
| diff | weights of gens                     |
|    1 | (7, 9), (8, 10), (13, 15)           |
|    2 | (4, 8), (7, 11)                     |
|    3 | (3, 9), (6, 12)                     |
|    4 | (4, 12), (5, 13), (8, 16)           |
|    5 | (5, 15), (6, 16), (7, 17), (10, 20) |
|    6 | (2, 14), (3, 15), (6, 18)           |
|    7 | (4, 18), (5, 19), (7, 21), (8, 22)  |

#+BEGIN_SRC sage
  from os.path import join

  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  Path = os.path.expanduser('~/work/rust/hilbert_sqrt5/')
#+END_SRC

#+RESULTS:

* Structure 6 gens
#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  to_pols_normalized(load(join(Path, "data/str6gens1.sobj")))
#+END_SRC

#+RESULTS:
: [1680*g2^2*g6 + 315000*g5^2, -g2^4, 504000*g2*g5]

#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  to_pols_normalized(load(join(Path, "data/str6gens2.sobj")))
#+END_SRC

#+RESULTS:
: [1680*g2^2*g6, -g2^3, 63000*g5]

#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  to_pols_normalized(load(join(Path, "data/str6gens.sobj")))
#+END_SRC

#+RESULTS:
: [-1680*g6, -63000*g5, g2]


* Structure 5 gens
#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  [factor(a) for a in to_pols_normalized(load(join(Path, "data/str5gens1.sobj")))]
#+END_SRC

#+RESULTS:
: [(1814400) * g6 * g2^2, (-11) * g2^2 * (g2^3 - 1080*g6), (1512000) * g5 * g2^2]

#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  [a for a in to_pols_normalized(load(join(Path, "data/str5gens2.sobj")))]
#+END_SRC

#+RESULTS:
: [-g2^4 + 1080*g2*g6, 1632960000*g2*g5, 1814400*g2^3]

#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  to_pols_normalized(load(join(Path, "data/str5rel12.sobj")))
#+END_SRC

#+RESULTS:
: [g2*g5, 29937600*g6, 18144000*g5, -165*g2]


* Structure 7 gens
#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  [factor(a.change_ring(ZZ)) for a in to_pols_normalized(load(join(Path, "data/str7gens1.sobj")))]
#+END_SRC

#+RESULTS:
:
: [2^3 * 3^3 * 5 * g5^2 * (-29*g2^3 + 43200*g6),
:  2^8 * 3^4 * 5^2 * g5 * (13*g2^2*g6 + 12000*g5^2),
:  g2 * (-5*g2*g5^2 + 4*g6^2)]

#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  [factor(a.change_ring(ZZ)) for a in to_pols_normalized(load(join(Path, "data/str7gens2.sobj")))]
#+END_SRC

#+RESULTS:
:
: [g6 * g2^2 * (-29*g2^3 + 43200*g6),
:  2^6 * 3^4 * 5^2 * 13 * g2^3 * (-29*g2^3 + 43200*g6),
:  (-1) * 2^6 * 3^5 * 5^3 * 7^2 * g5 * (-29*g2^3 + 43200*g6)]



#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  [factor(a.change_ring(ZZ)) for a in to_pols_normalized(load(join(Path, "data/str7gens3.sobj")))]
#+END_SRC

#+RESULTS:
:
: [(-1) * g6 * (-29*g2^3 + 43200*g6),
:  2^6 * 3^5 * 5^3 * 7^2 * g5 * (-29*g2^3 + 43200*g6),
:  (-1) * 2^6 * 3^4 * 5^2 * 13 * g2 * (-29*g2^3 + 43200*g6)]

#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  to_pols_normalized(load(join(Path, "data/str7rel10.sobj")))
#+END_SRC

#+RESULTS:
: [g6, -95256000*g5, 0, 1684800*g2]

#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  to_pols_normalized(load(join(Path, "data/str7rel13.sobj")))
#+END_SRC

#+RESULTS:
: [g2^2*g5, -76204800*g2*g6, 6264*g2^3 - 9331200*g6, -1244160000*g5]


* Structure 8 gens
** Singular result
#+BEGIN_SRC sh :results raw
  echo "#+BEGIN_SRC sage :results none"
  echo "m8 = {}"
  echo "sm8 = {}"
  Singular -q ../src/singular/a8.txt
  echo "#+END_SRC"
#+END_SRC

#+RESULTS:
#+BEGIN_SRC sage :results none
m8 = {}
sm8 = {}
1
m8[1]=[47*g2^3*g5+86400*g5*g6,-1890*g2^2*g6+3240000*g5^2]
m8[2]=[47*g2^3*g6+86400*g6^2,-1050*g2^3*g5+3240000*g5*g6]
m8[3]=[5*g2^2*g5^2-9*g2*g6^2]
m8[4]=[0,5*g2^2*g5^2-9*g2*g6^2]
sm8[1]=[g6,-g5,0,-210*g2]
sm8[2]=[5*g2^2*g5,-9*g2*g6,-47*g2^3-86400*g6,-3240000*g5]
#+END_SRC

#+BEGIN_SRC sage
  [m8[i][0].weighted_degree([2, 5, 6]) - 8 for i in range(1, 4)] + [m8[4][1].weighted_degree([2, 5, 6]) - 7]
  [sm8[i][0].weighted_degree([2, 5, 6]) + 3 for i in [1, 2]]
#+END_SRC

#+RESULTS:
: [3, 4, 6, 7]
: [9, 12]

Conclusion: Two relations among 4 generators.


** Gens check
#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  [factor(a.change_ring(ZZ)) for a in to_pols_normalized(load(join(Path, "data/str8gens1.sobj")))]
#+END_SRC

#+RESULTS:
: [(-1) * 5^2 * (-135*g2^3*g5^2 + 196*g2^2*g6^2 - 48000*g5^2*g6),
:  (-1) * 2 * 3 * 5^4 * g5 * (7*g2^2*g6 - 12000*g5^2),
:  2^3 * 3^2 * 7 * g2 * (-5*g2*g5^2 + 9*g6^2)]

#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  pl8_6_7 = to_pols_normalized(load(join(Path, "data/str8gens1.sobj")))[-1]
  (pl8_6_7**2).divides(to_pol1(load(join(Path, "data/str8gens_norm_17.sobj"))))
  (pl8_6_7**2).divides(to_pol1(load(join(Path, "data/str8gens_norm_18.sobj"))))
#+END_SRC

#+RESULTS:
: True
: True


* Structure 9 gens
** Singular result
#+BEGIN_SRC sh :results raw
  echo "#+BEGIN_SRC sage :results none"
  echo "m9 = {}"
  echo "sm9 = {}"
  echo "sm9_2 = {}"
  Singular -q ../src/singular/a9.txt
  echo "#+END_SRC"
#+END_SRC

#+RESULTS:
#+BEGIN_SRC sage :results none
m9 = {}
sm9 = {}
sm9_2 = {}
m9[1]=[7157983644*g2^3*g5*g6-2559782736000*g2*g5^3-26483628326400*g5*g6^2,-323*g2^8+703786*g2^5*g6-1693956600*g2^3*g5^2+18801456480*g2^2*g6^2]
m9[2]=[153*g2^5*g6-293580*g2^3*g5^2+641898*g2^2*g6^2-2354184000*g5^2*g6,170*g2^5*g5+864000*g2^2*g5*g6]
m9[3]=[2404602*g2^5*g5-13245444000*g2^2*g5*g6+8475062400000*g5^3,-323*g2^7+2841210*g2^4*g6+5608440000*g2^2*g5^2]
m9[4]=[323*g2^7-113682*g2^4*g6+542808000*g2^2*g5^2-6162220800*g2*g6^2,1524900*g2^4*g5+7750080000*g2*g5*g6]
sm9[1]=[54000*g5,133589*g2^3-607478400*g6,16310*g2*g5,-63279*g2*g6]
sm9[2]=[17*g2^2,-404985600*g5,-17*g2^3-112496*g6,126558*g2*g5]
1
#+END_SRC

#+BEGIN_SRC sage
  [m9[i][1].weighted_degree([2, 5, 6]) - 10 for i in range(1, 5)]
  [sm9[i][0].weighted_degree([2, 5, 6]) + 6 for i in [1, 2]]
  [sm9[i][1].weighted_degree([2, 5, 6]) + 5 for i in [1, 2]]
#+END_SRC

#+RESULTS:
: [6, 5, 4, 3]
: [11, 10]
: [11, 10]

#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  for i, f in zip(range(1, 6), ["f24", "f23", "f22", "f21"]):
      print "let %s = %s;" % (f, tpl_to_rust_code(m9[i], ["f7", "f8"]))
#+END_SRC

#+RESULTS:
: let f24 = into(g2.pow(3) * g5 * g6 * &Mpz::from_str_radix("7157983644", 10).unwrap() + g5 * g6.pow(2) * &Mpz::from_str_radix("-26483628326400", 10).unwrap() + g2 * g5.pow(3) * &Mpz::from_str_radix("-2559782736000", 10).unwrap()) * f7 + into(g2.pow(5) * g6 * (703786) + g2.pow(3) * g5.pow(2) * (-1693956600) + g2.pow(8) * (-323) + g2.pow(2) * g6.pow(2) * &Mpz::from_str_radix("18801456480", 10).unwrap()) * f8;
: let f23 = into(g2.pow(5) * g6 * (153) + g2.pow(3) * g5.pow(2) * (-293580) + g5.pow(2) * g6 * (-2354184000) + g2.pow(2) * g6.pow(2) * (641898)) * f7 + into(g2.pow(2) * g5 * g6 * (864000) + g2.pow(5) * g5 * (170)) * f8;
: let f22 = into(g2.pow(2) * g5 * g6 * &Mpz::from_str_radix("-13245444000", 10).unwrap() + g5.pow(3) * &Mpz::from_str_radix("8475062400000", 10).unwrap() + g2.pow(5) * g5 * (2404602)) * f7 + into(g2.pow(4) * g6 * (2841210) + g2.pow(2) * g5.pow(2) * &Mpz::from_str_radix("5608440000", 10).unwrap() + g2.pow(7) * (-323)) * f8;
: let f21 = into(g2.pow(4) * g6 * (-113682) + g2 * g6.pow(2) * &Mpz::from_str_radix("-6162220800", 10).unwrap() + g2.pow(2) * g5.pow(2) * (542808000) + g2.pow(7) * (323)) * f7 + into(g2 * g5 * g6 * &Mpz::from_str_radix("7750080000", 10).unwrap() + g2.pow(4) * g5 * (1524900)) * f8;

** Check construction
#+BEGIN_SRC sage
  a18 = (-1) * 2^4 * 5^2 * g2 * (-323*g2^8 + 1486092*g2^5*g6 - 3176220600*g2^3*g5^2 + 11920045860*g2^2*g6^2 - 21117030480000*g5^2*g6)
  (a18**2).divides(to_pol1(load(join(Path, "data/str9gens_norm_21.sobj"))))
  (a18**2).divides(to_pol1(load(join(Path, "data/str9gens_norm_22.sobj"))))
  (a18**2).divides(to_pol1(load(join(Path, "data/str9gens_norm_23.sobj"))))
  (a18**2).divides(to_pol1(load(join(Path, "data/str9gens_norm_24.sobj"))))
#+END_SRC

#+RESULTS:
: True
: True
: True
: True


* Structure 10 gens
Generators of weights 2, 5, 5, 6 and relations of weight  11, 12.
** Singular result
#+BEGIN_SRC sh :results raw
  echo "#+BEGIN_SRC sage :results none"
  echo "m10 = {}"
  echo "sm10 = {}"
  Singular -q ../src/singular/a10.txt
  echo "#+END_SRC"
#+END_SRC

#+RESULTS:
#+BEGIN_SRC sage :results none
m10 = {}
sm10 = {}
'''
[1]:
   _[1]=[1798193397*g2^3*g5*g6-3754266516000*g2*g5^3+9017763955200*g5*g6^2,-59081*g2^7+117588672*g2^4*g6-1920796416000*g2^2*g5^2+5189042995200*g2*g6^2]
   _[2]=[77*g2^6*g6-396880*g2^4*g5^2-767004*g2^3*g6^2-42192000*g2*g5^2*g6,17600*g2^5*g5-276480000*g2^2*g5*g6]
   _[3]=[24575309759*g2^6*g5+789630086044800000*g2*g5^3-1874672633433600000*g5*g6^2,12904381820*g2^7-19200158784000*g2^4*g6+459386484480000000*g2^2*g5^2-1078732704153600000*g2*g6^2]
   _[4]=[451*g2^7-690852*g2^4*g6+15933456000*g2^2*g5^2-37868083200*g2*g6^2]
[2]:
   _[1]=[7672400000*g2*g5,2234119069*g2^3+18831989030400*g6,32080*g2*g5,-381434963*g2^2*g6+217962836000*g5^2]
   _[2]=[314741020*g2^3-3121333056000*g6,-3262642099516800*g5,1441*g2^3-15014592*g6,-78521111669*g2^2*g5]
[3]:
   _[1]=0
'''
m10[1]=[1798193397*g2^3*g5*g6-3754266516000*g2*g5^3+9017763955200*g5*g6^2,-59081*g2^7+117588672*g2^4*g6-1920796416000*g2^2*g5^2+5189042995200*g2*g6^2]
m10[2]=[77*g2^6*g6-396880*g2^4*g5^2-767004*g2^3*g6^2-42192000*g2*g5^2*g6,17600*g2^5*g5-276480000*g2^2*g5*g6]
m10[3]=[24575309759*g2^6*g5+789630086044800000*g2*g5^3-1874672633433600000*g5*g6^2,12904381820*g2^7-19200158784000*g2^4*g6+459386484480000000*g2^2*g5^2-1078732704153600000*g2*g6^2]
m10[4]=[451*g2^7-690852*g2^4*g6+15933456000*g2^2*g5^2-37868083200*g2*g6^2]
sm10[1]=[7672400000*g2*g5,2234119069*g2^3+18831989030400*g6,32080*g2*g5,-381434963*g2^2*g6+217962836000*g5^2]
sm10[2]=[314741020*g2^3-3121333056000*g6,-3262642099516800*g5,1441*g2^3-15014592*g6,-78521111669*g2^2*g5]
#+END_SRC

#+BEGIN_SRC sage
  [m10[i][0].weighted_degree([2, 5, 6]) - 12 for i in range(1, 5)]
  [sm10[i][0].weighted_degree([2, 5, 6]) + 5 for i in [1, 2]]
  [sm10[i][1].weighted_degree([2, 5, 6]) + 6 for i in [1, 2]]
#+END_SRC

#+RESULTS:
: [5, 6, 5, 2]
: [12, 11]
: [12, 11]

#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  for i, f in zip(range(1, 5), ["f21", "f22", "h21", "f18"]):
      print "let %s = %s;" % (f, tpl_to_rust_code(m10[i], ["f4", "f7"]))
#+END_SRC

#+RESULTS:
: let f21 = into(g2.pow(3) * g5 * g6 * (1798193397) + g5 * g6.pow(2) * &Mpz::from_str_radix("9017763955200", 10).unwrap() + g2 * g5.pow(3) * &Mpz::from_str_radix("-3754266516000", 10).unwrap()) * f4 + into(g2.pow(4) * g6 * (117588672) + g2 * g6.pow(2) * &Mpz::from_str_radix("5189042995200", 10).unwrap() + g2.pow(2) * g5.pow(2) * &Mpz::from_str_radix("-1920796416000", 10).unwrap() + g2.pow(7) * (-59081)) * f7;
: let f22 = into(g2.pow(6) * g6 * (77) + g2.pow(3) * g6.pow(2) * (-767004) + g2 * g5.pow(2) * g6 * (-42192000) + g2.pow(4) * g5.pow(2) * (-396880)) * f4 + into(g2.pow(2) * g5 * g6 * (-276480000) + g2.pow(5) * g5 * (17600)) * f7;
: let h21 = into(g5 * g6.pow(2) * &Mpz::from_str_radix("-1874672633433600000", 10).unwrap() + g2.pow(6) * g5 * &Mpz::from_str_radix("24575309759", 10).unwrap() + g2 * g5.pow(3) * &Mpz::from_str_radix("789630086044800000", 10).unwrap()) * f4 + into(g2.pow(4) * g6 * &Mpz::from_str_radix("-19200158784000", 10).unwrap() + g2 * g6.pow(2) * &Mpz::from_str_radix("-1078732704153600000", 10).unwrap() + g2.pow(2) * g5.pow(2) * &Mpz::from_str_radix("459386484480000000", 10).unwrap() + g2.pow(7) * &Mpz::from_str_radix("12904381820", 10).unwrap()) * f7;
: let f18 = into(g2.pow(4) * g6 * (-690852) + g2 * g6.pow(2) * &Mpz::from_str_radix("-37868083200", 10).unwrap() + g2.pow(2) * g5.pow(2) * &Mpz::from_str_radix("15933456000", 10).unwrap() + g2.pow(7) * (451)) * f4;

** Check construction
#+BEGIN_SRC sage
  a16 = (98227800) * g2^2 * (g2^6 - 690852/451*g2^3*g6 + 1448496000/41*g2*g5^2 - 37868083200/451*g6^2)
  (a16**2).divides(to_pol1(load(join(Path, "data/str10gens_norm_21.sobj"))))
  (a16**2).divides(to_pol1(load(join(Path, "data/str10gens_norm_22.sobj"))))
  (a16**2).divides(to_pol1(load(join(Path, "data/str10gens_norm_21_1.sobj"))))
  (a16**2).divides(to_pol1(load(join(Path, "data/str10gens_norm_18.sobj"))))
#+END_SRC

#+RESULTS:
: True
: True
: True
: True


* Structure5 brackets
#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  factor((to_pol1(load(join(Path, "data/str5br5_6.sobj")))/K.gen()).change_ring(ZZ))
  factor((to_pol1(load(join(Path, "data/str5br5_7.sobj")))/K.gen()).change_ring(ZZ))
  factor((to_pol1(load(join(Path, "data/str5br6_7.sobj")))/K.gen()).change_ring(ZZ))
  factor((to_pol1(load(join(Path, "data/str5br5_10.sobj")))/K.gen()).change_ring(ZZ))
  factor((to_pol1(load(join(Path, "data/str5br6_10.sobj")))/K.gen()).change_ring(ZZ))
  factor((to_pol1(load(join(Path, "data/str5br7_10.sobj")))/K.gen()).change_ring(ZZ))
#+END_SRC

#+RESULTS:
: 2^8 * 3^6 * 5^3 * 7 * 11 * g2^3
: (-1) * 2^10 * 3^8 * 5^5 * 7 * 11 * g5 * g2
: 2 * 3^2 * 5 * 11 * g2 * (-g2^3 + 1080*g6)
: 2^14 * 3^10 * 5^4 * 7^2 * (11*g2^2*g6 - 6000*g5^2)
: 2^8 * 3^5 * 5^2 * 7 * g5 * (-11*g2^3 + 10800*g6)
: (-1) * 2^7 * 3^6 * 5^2 * 7 * (-11*g2^3*g6 - 600*g2*g5^2 + 11880*g6^2)


* Structure7 brackets

#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  factor((to_pol1(load(join(Path, "data/str7br5_6.sobj")))/K.gen()).change_ring(ZZ))
  factor((to_pol1(load(join(Path, "data/str7br5_7.sobj")))/K.gen()).change_ring(ZZ))
#+END_SRC

#+RESULTS:
: (-1) * 2^12 * 3^8 * 5^5 * 7 * 13 * g2 * (-29*g2^3 + 43200*g6)
: 2^9 * 3^5 * 5^5 * 7 * g5 * (13*g2^3 + 9600*g6)

* Structure 9 brackets
#+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  factor((to_pol1(load(join(Path, "data/str9br7_8.sobj")))/K.gen()).change_ring(ZZ))
  factor((to_pol1(load(join(Path, "data/str9br7_11.sobj")))/K.gen()).change_ring(ZZ))
  factor((to_pol1(load(join(Path, "data/str9br8_11.sobj")))/K.gen()).change_ring(ZZ))
#+END_SRC

#+RESULTS:
: (-1) * 2^4 * 5^2 * g2 * (-323*g2^8 + 1486092*g2^5*g6 - 3176220600*g2^3*g5^2 + 11920045860*g2^2*g6^2 - 21117030480000*g5^2*g6)
: (-1) * 2^2 * 5^2 * 11 * 13 * g5 * g2^2 * (323*g2^6 + 2669106*g2^3*g6 + 710402400*g2*g5^2 + 2336273280*g6^2)
: 2^2 * 5^2 * 11 * 13 * (323*g2^8*g6 - 323874*g2^6*g5^2 + 1808610*g2^5*g6^2 - 7555592736*g2^3*g5^2*g6 + 1073507904000*g2*g5^4 + 1902585672*g2^2*g6^3 - 6661399046400*g5^2*g6^2)

* Structure 10 brackets
 #+BEGIN_SRC sage
  load('~/work/rust/hilbert_sqrt5/src/modstr.py')
  factor((to_pol1(load(join(Path, "data/str10br4_7.sobj")))/K.gen()))
  factor((to_pol1(load(join(Path, "data/str10br4_11.sobj")))/K.gen()))
  factor((to_pol1(load(join(Path, "data/str10br7_11.sobj")))/K.gen()))
#+END_SRC

#+RESULTS:
: (98227800) * g2^2 * (g2^6 - 690852/451*g2^3*g6 + 1448496000/41*g2*g5^2 - 37868083200/451*g6^2)
: (-8938729800) * g2 * (g2^6*g6 + 4800*g2^4*g5^2 + 3270240/451*g2^3*g6^2 + 570240000/41*g2*g5^2*g6 - 4478976000/451*g6^3)
: (74489415/2) * g5 * (g2^9 + 488526/41*g2^6*g6 + 383414400/41*g2^4*g5^2 - 291611880/41*g2^3*g6^2 + 86067360000/41*g2*g5^2*g6 - 169827840000/41*g6^3)
